In [18]:
import pandas as pd
import numpy as np
import random
import string
np.random.seed(56)

In [10]:
pd.DataFrame({"A": [1,2], "B": [3, 4], "C": [5,6]}, index=[1,2])

   A  B  C
1  1  3  5
2  2  4  6

In [15]:
pd.DataFrame(
[[4, 7, 10],
[5, 8, 11]],
index=[1,2],
columns=["A", "B", "C"])

   A  B   C
1  4  7  10
2  5  8  11

In [16]:
pd.DataFrame(
{"a" : [1, 2, 3],
"b" : [4, 5, 6],
"c" : [7, 8, 9]},
index= pd.MultiIndex.from_tuples(
[('d',1),('d',2),('e',2)],
 names=['n','v']))

     a  b  c
n v
d 1  1  4  7
  2  2  5  8
e 2  3  6  9

In [17]:
pd.Series({"한국":"서울","일본":"도쿄","중국":"베이징"})

한국     서울
일본     도쿄
중국    베이징
dtype: object

In [19]:
pd.DataFrame(np.random.randint(0, 100, size=(2, 3)))

    0   1   2
0  85  15  64
1  34  14  87

In [21]:
[random.choice(string.ascii_letters)]

['l']

In [27]:
def id():
    return ''.join(random.choice(string.ascii_letters) for i in range(5))

In [28]:
print(id())

RjiNR

In [93]:
def sco():
    return [np.random.randint(0,100)*(a-a+1) for a in range(4)]

In [94]:
print(sco())

[1, 5, 74, 18]

In [110]:
pd.DataFrame([sco() for i in range(10)],
             columns=["국", "수", "사", "과"],
             index=[id() for i in range(10)]
)

        국   수   사   과
QbZsy  54  29  80  47
oeoyA  45  37  15   5
ZbZRD   9  13   8  23
Otgtd  49   8  74  44
MjSDD  58  95  25   8
hokff  71  20  15  74
hazkD  93  49  36  85
FpoeL  85  90  60  10
MTqeu  20  14  61  98
YSQnS  71  58  39  87